---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndHookOffset
source: html/3e56968e-6c7e-a576-245f-d5e22dd61a02.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndHookOffset Property

"End Hook Offset Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeEndHookOffset { get; }
```